{
    "spaceship.section1.title" : "Introducción",
    "spaceship.section1": "El proyecto padawans fue un trabajo práctico integrador de la materia TGC (técnicas de gráficos por computadora) de mi carrera. Se pidió desarrollar un juego utilizando un framework dado por la cátedra. Aplicamos los conocimientos adquiridos en la materia, desde las buenas prácticas en cuanto a manipulación de objetos 3D y optimizaciones de render, hasta el desarrollo de shaders para la adición de efectos gráficos.",
    "spaceship.section2.title" : "Arquitectura",
    "spaceship.section3.title" : "Jugabilidad",
    "spaceship.section3": "Consiste en manejar la famosa nave x-wing en la Death Star, (situación que transcurre en Star Wars episode V) y disparar un misil especial por un ducto que hará que la nave explote por completo. Pero para llegar allí hay que eliminar torretas que disparan sin piedad, esquivar naves enemigas que también intentar derribarte y no chocarte con ninguna de las paredes del escenario. La nave dispara misiles para combatir los enemigos, y realiza algunas piruetas en el aire.",
    "spaceship.section4.title" : "Minimapa",
    "spaceship.section4": "Cuenta con un minimapa que puede activarse y desactivarse presionando la tecla m. En el mismo se muestra el progreso del nivel y se marcan las posiciones de las naves enemigas.",
    "spaceship.section5.title" : "La cámara",
    "spaceship.section5": "Posee una cámara que sigue constantemente a la nave desde la parte de atrás, pero con un sutil retraso frente a los movimientos de la nave lo cual le da una mayor sensación de realismo en la navegación del escenario.",
    "spaceship.section6.title" : "Shaders",
    "spaceship.section6" : "Los shaders principales desarrollados:",
    "spaceship.section6.item1" : "Desenfoque gaussiano para el brillo de los disparos laser y las turbinas de la nave x-wing",
    "spaceship.section6.item2" : "Color metálico en la textura de la nave x-wing",
    "spaceship.section6.item3" : "Sombreado de la textura de la nave x-wing",
    "spaceship.section6.item4" : "Sombras de la nave x-wing, las naves enemigas y los misiles disparados proyectadas en la superficie de la Death Star",
    "spaceship.section6.item5" : "Oscurecimiento de todo el escenario al presionar el botón de pausa",
    "spaceship.section6.item6" : "Oscurecimiento total de la nave cuando se pierde el juego",
    "spaceship.section7.title" : "La estrategia",
    "spaceship.section7" : "El objetivo del juego es lograr llegar hasta el otro lado de la Death Star y disparar el misil especial en el ducto. Hay básicamente dos estrategias para lograrlo, volar bajo por el túnel esquivando torretas, lo cual hará que las naves no te localicen, o volar alto esquivando las torretas pero enfrentandose a las varias naves que te persiguen. Cualquier estrategia elegida necesitará volar rápido e intentando no hacerlo en linea recta, ya que de esa manera los misiles te alcanzarán.",
    "spaceship.section8.title" : "Los controles",
    "spaceship.section8.item1" : "Controles del juego",
    "spaceship.section8.item2" : "Controles de debug",
    "spaceship.section8.item1.item1" : "Shift: Aceleración",
    "spaceship.section8.item1.item2" : "Left ctrl: Desaceleración",
    "spaceship.section8.item1.item3" : "Space: 360° barrel roll",
    "spaceship.section8.item1.item4" : "B: 180° barrel roll",
    "spaceship.section8.item1.item5" : "Left click: Shoot",
    "spaceship.section8.item1.item6" : "G: Special shot",
    "spaceship.section8.item1.item7" : "AWSD: Drive the ship",
    "spaceship.section8.item1.item8" : "Mouse wheel: Zoom in/out",
    "spaceship.section8.item1.item9" : "I: Activate/deactivate map",
    "spaceship.section8.item1.item10" : "M: Activate/deactivate sound",
    "spaceship.section8.item2.item1" : "U: Show bullet colliders",
    "spaceship.section8.item2.item2" : "F: Show original not scaled 3D colliders",
    "spaceship.section8.item2.item3" : "V: Super acceleration",
    "spaceship.section8.item2.item4" : "C: Super desaceleration",
    "spaceship.section8.item2.item5" : "IDDQD: God mode",
    "spaceship.section9.title" : "La inteligencia de los enemigos",
    "spaceship.section9" : "Los naves enemigas te perseguirán si estas en su radio de visibilidad, dentro de una distancia máxima, y por sobre el túnel de las torretas. Cuando te persigan te dispararán automáticamente. En caso de que no estés en su radio de visibilidad, irán en linea recta vagando por el espacio hasta que te cruces en su camino. Si logras dispararles y neutralizarlas, no te perseguirán ni dispararán, aunque esto es muy difícil. Casi imposible ya que se mueven muy rápido. Por otro lado las torretas son inmóviles, aunque mas abundantes en número. Puedes neutralizarlas mas fácil. Te dejarán de disparar, aunque encontrarás algunas que serán invencibles. Por último, el enemigo mas estático son las paredes y obstáculos bloqueando el camino. Debes esquivarlos ya que estos también te disminuirán energía.",

    "workInProgress.title" : "Sección en construcción",

    "layout.box1.description" : "Soy Alejandro Daniel Barreto y este es mi sitio web",
    "layout.box2.description" : "A game developed in Angular",
    "layout.box3.description" : "Domino developed in ReactJS",
    "layout.box4.description" : "A blog with developing stuff",
    "layout.box5.title" : "cv / contact me",
    "layout.box6.description" : "A spaceship game made in c#",
    "layout.box7.description" : "A project developed in java"
}